In [1]:
# import pandas as pd 

import pandas as pd 

  
# list of strings 

lst = ['Geeks', 'For', 'Geeks', 'is',  

            'portal', 'for', 'Geeks'] 

  
# Calling DataFrame constructor on list 

df = pd.DataFrame(lst) 
df

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [2]:
lst = [['tom', 25], ['krish', 30], 

       ['nick', 26], ['juli', 22]] 

    

df = pd.DataFrame(lst, columns =['Name', 'Age']) 
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [6]:
df1 = pd.DataFrame(columns=['A'])
for i in range(5):
    df1 = df1.append({'A': i}, ignore_index=True)
df1

   A
0  0
1  1
2  2
3  3
4  4

In [12]:
df2 = pd.concat([pd.DataFrame([i], columns=['A']) for i in range(8)],ignore_index=True)
df2

   A
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7

In [7]:
def anti_join(x, y, on):
    """Return rows in x which are not present in y"""
    ans = pd.merge(left=x, right=y, how='left', indicator=True, on=on)
    ans = ans.loc[ans._merge == 'left_only', :].drop(columns='_merge')
    return ans


def anti_join_all_cols(x, y):
    """Return rows in x which are not present in y"""
    assert set(x.columns.values) == set(y.columns.values)
    return anti_join(x, y, x.columns.tolist())

In [16]:
df3 = anti_join(df2, df1, 'A')
df3

   A
5  5
6  6
7  7